; domain
; domain.pddl
(define (domain store-in-drawer)
  (:requirements :strips)

  (:predicates
    (at      ?o ?l)    
    (in      ?o ?c)   
    (holding ?o)       
    (arm-empty)        
    (open    ?c)       
    (closed  ?c)       
  )

  (:action open
    :parameters (?c)
    :precondition (closed ?c)
    :effect (and
      (open   ?c)
      (not (closed ?c))
    )
  )

  (:action close
    :parameters (?c)
    :precondition (open ?c)
    :effect (and
      (closed ?c)
      (not (open ?c))
    )
  )

  (:action pick-up
    :parameters (?o ?l)
    :precondition (and
      (at        ?o ?l)
      (arm-empty)
    )
    :effect (and
      (holding   ?o)
      (not (at   ?o ?l))
      (not (arm-empty))
    )
  )

  (:action place-on
    :parameters (?o ?l)
    :precondition (holding ?o)
    :effect (and
      (at        ?o ?l)
      (arm-empty)
      (not (holding ?o))
    )
  )

  (:action place-in
    :parameters (?o ?c)
    :precondition (and
      (holding ?o)
      (open    ?c)
    )
    :effect (and
      (in      ?o ?c)
      (arm-empty)
      (not (holding ?o))
    )
  )
)

; problem
; problem.pddl
(define (problem storeUtensils)
  (:domain store-in-drawer)

  (:objects
    spoon fork table drawer
  )

  (:init
    (at        spoon table)
    (at        fork  table)
    (arm-empty)
    (closed    drawer)
  )

  (:goal
    (and
      (in spoon drawer)
      (in fork  drawer)
    )
  )
)

; plan
1. (open drawer)
   deleted: (closed drawer)
   added: (open drawer)
   goals met: 0 of 2
2. (pick-up fork table)
   deleted: (at fork table) (arm-empty)
   added: (holding fork)
   goals met: 0 of 2
3. (place-in fork drawer)
   deleted: (holding fork)
   added: (in fork drawer) (arm-empty)
   goals met: 1 of 2
4. (pick-up spoon table)
   deleted: (at spoon table) (arm-empty)
   added: (holding spoon)
   goals met: 1 of 2
5. (place-in spoon drawer)
   deleted: (holding spoon)
   added: (in spoon drawer) (arm-empty)
   goals met: 2 of 2
